{
  "world": {
    "name": "Borom",
    "city": {
      "name": "Pilgrim's Rest",
      "description": "somber and enigmatic town. The cobblestone streets are lined with ancient, ivy-covered buildings that whisper tales of a forgotten past."
    }
  },
  "defaults": {
    "player": {
      "money": 100,
      "gear": 1,
      "home": 1
    }
  },
  "guilds": {
    "max_level": 10,
    "players_per_level": 4,
    "creation_cost": 1000,
    "max_tax": 50
  },
  "modify_cost": 1000,
  "money": {
    "name": "Boromian Alloy"
  },
  "quests": {
    "base_xp_reward": 950,
    "base_money_reward": 760
  },
  "minigames": {
    "hands": {
      "min_buy_in": 5,
      "max_buy_in": 50,
      "payout": 1.5,
      "xp_reward": 2,
      "cooldown": 120,
      "explanation": "_\"Do not hold the pilgrim's hands for he is blinded by faith\"_\n\n2 player game played with *3 d6 each*.\n\nBoth you & the other player choose a *target number between 3 and 18*, then you roll until someone wins.\n\nIf a player gets either *5 or 10 they lose*. If a player gets their *target number* with either *all 3 or just 2 of their dices* they win.\n\nPays 150% of the pot."
    },
    "fate": {
      "min_buy_in": 50,
      "max_buy_in": 200,
      "payout": 2,
      "xp_reward": 7,
      "cooldown": 300,
      "explanation": "_\"The pilgrim's fate is to perpetually walk the mortal plane, undying in a dying world... Lucky, some might say...\"_\n\n2 player dice game. Roll a D13 3 times.\n\nIf a player exceeds 27 they lose.\n\nWins who gets the highest score without exceeding 27."
    },
    "open": {
      "xp_reward": 5,
      "money_reward": 5,
      "explanation": "_\"Some doors get possessed by fragments of their dead former owners and only open when a word they identified in life with is whispered in the key hole\"_\n\nGuess a random word in the given amount of tries.",
      "renown": 2
    },
    "illusion": {
      "xp_reward": 10,
      "money_reward": 10,
      "cooldown": 300,
      "explanation": "_\"Some walls are mere illusions, but beware of dispelling them, you might not like what they hide...\"_\n\nNavigate a maze by typing 'n'(north), 's'(south), 'e'(east) & 'w'(west), or 'i'(idle) for a tick. Moving in a direction moves you until you hit a wall, the exit or an active trap.\n\nYou can optionally define the amount of steps you want to take, for example:\n`n 2` will walk 2 steps to the north.\n`n` will walk north until you hit a wall.\n\nNote that both the previous commands will consume a single turn.\n\nBeware of spike traps that activate & deactivate each tick.\n\nFinish the maze in the given number of turns",
      "renown": 1
    },
    "boss": {
      "xp_reward": 50,
      "money_reward": 50,
      "cooldown": 300,
      "explanation": "WIP. Do not play",
      "renown": 4
    }
  },
  "meeting events": {
    "town": [
      "visit the tavern together, sharing stories of your adventures.",
      "check out the market stalls together.",
      "train together.",
      "play a couple games of the royal game of Ur.",
      "walk on the town walls together, taking in the view.",
      "hunt plague rats with flaming bolts.",
      "visit the smithy together to perform maintenance your equipment",
      "exchange trinkets you collected during your adventures",
      "spend some time together, enjoying each-other's company.",
      "accompany them to the cemetery to mourn your loved ones.",
      "talk about conspiracy theories for an hour. You are convinced they are all true.",
      "greet them tiredly, then you immediately go home where you take an invigorating nap.",
      "spot a Pilgrim watching you two talk. He sees you are bound by the Ouroboros contract. He sees your chains.",
      "kill some time hunting pigeons together.",
      "kill some slimy monsters hiding in the town's sewers."
    ],
    "zones": [
      "spend some time around a campfire roasting some freshly hunted small game.",
      "walk together for a bit, sharing knowledge about the area.",
      "silently nod to each-other, for there are monsters nearby.",
      "clear the way ahead together, protecting each-other from danger.",
      "gather supplies to prepare for the dangers ahead.",
      "polish your equipment in silence, watching each-others back",
      "play a couple of games of 'Hands', as it is a traditional game most played by adventurers on a quest.",
      "help them open a particularly stubborn chest. It turns out it was a mimic, so you kill it together.",
      "help each-other climb a particularly tall wall.",
      "throw rocks at some monsters below you. They can't reach you and they make funny noises when hit.",
      "share a pemmican & hardtack meal since lighting a fire was not an option.",
      "hide from them until they leave. You are not feeling too sociable right now.",
      "come across a Pilgrim, undying & blindly following the path his faith lays for him. You both watch him, mesmerized.",
      "do the secret adventurer salute. They reciprocate.",
      "trade some supplies.",
      "hide together from a pack of monsters approaching your position",
      "help each-other move some debris from a blocked passageway.",
      "carve your names into a wall, as way to leave a mark on this cruel world."
    ]
  },
  "spells": {
    "mida": {
      "name": "Mida's touch",
      "description": "Create Boromian Alloy from thin air.",
      "power": 10
    },
    "bones": {
      "name": "Bone recall",
      "description": "Recall the experiences of the bone's former owner.",
      "power": 10
    },
    "displacement": {
      "name": "Eldritch displacement",
      "description": "Briefly travel through another dimension where time and space are distorted, gaining time on your quest.",
      "power": 20
    },
    "glitch": {
      "name": "Alloy glitch",
      "description": "The next time you earn money the amount will be multiplied by 1.5 times for every 30 power used.",
      "power": 30
    },
    "hex": {
      "name": "Ancient Hex",
      "description": "Hex someone of your choosing, they will have a disadvantage finishing their next quest. Send the name after 'hex'. Double the effect if you use 100 power.",
      "power": 50,
      "args": 1
    },
    "bless": {
      "name": "Ancient Blessing",
      "description": "Bless someone of your choosing, they will have an advantage finishing their next quest. Send the name after 'bless'. Triple the effect if you use 100 power.",
      "power": 50,
      "args": 1
    }
  },
  "quick time events": [{
    "description": "You find a locked chest.",
    "options": "smash_it_open 90 | lockpick_it 50 | kick_it_open 20",
    "successes": "The chest lays at your feet, destroyed, some it's contents still intact.\n\nYou gain 20 xp & 20 BA | You manage to lockpick the chest, preserving it's contents.\n\nYou gain 100 xp & 100 BA | miraculously the chest opens with a single kick. You feel very good about yourself.\n\nYou gain 1000 xp & 100 BA.",
    "failures": "You completely destroyed the chest & it's contents. | You fail in your lock picking attempt. The chest remains closed | The kick does nothing. Your foot hurts.",
    "rewards": "xp 20, mn 20 | xp 100, mn 100 | xp 1000, mn 100"
  }, {
    "description": "You stumble upon a strong-looking sleeping monster holding a valuable artifact.",
    "options": "leave 90 | assassinate_the_monster 60 | try_to_sneakily_steal_the_artifact 10",
    "successes": "You leave the monster be, better safe than sorry.\n\nYou gain 20 xp. | You manage to kill the monster but the artifact is destroyed in the process.\n\nYou gain 100 xp & 100 BA. | You manage to retrieve the artifact.\n\nYou gain 1 artifact piece.",
    "failures": "The monster wakes up an chases you off. | The monster wakes up an fights back, forcing you to flee | The monster wakes up and roars, forcing you to flee.",
    "rewards": "xp 20 | xp 100, mn 100 | xp 1000, ap 1"
  }, {
    "description": "You hear faint crying coming from a room nearby.",
    "options": "leave 95 | investigate 50",
    "successes": "You leave, you don't want to get involved.\n\nYou gain 10 xp. | It turns out the crying was a tied up woman. You untie her and she rewards you with some Alloy.\n\nYou gain 100 xp & 50 BA.",
    "failures": "As soon as you start to leave, the crying stops. You turn around and you see empty eye sockets stalking you. You run. | It turns out the crying was just an hallucination.",
    "rewards": "xp 10 | xp 100, mn 50"
  }],
  "cults": [{
    "id": 0,
    "name": "Not in a cult",
    "description": "Not really a cult. 'Members' don't have any quirks, they are just standard adventurers.",
    "modifiers": {}
  }, {
    "id": 1,
    "name": "Cult of the Amygdala",
    "description": "Members are shunned by society, part of their rituals involves eating parts of human brains. The rituals and drugs they take let them access their latent eldritch powers, even without the aid of artifacts.",
    "modifiers": {
      "can_meet_players": false,
      "power_bonus": 10
    }
  }, {
    "id": 2,
    "name": "Inquisition Remnants",
    "description": "Remnants of the old Royal Inquisition sect. Even though the God emperor died long ago, the sacred talismans they hold still work, blocking the eldritch influences of old Gods.",
    "modifiers": {
      "eldritch_resist": true,
      "power_bonus": -100
    }
  }, {
    "id": 3,
    "name": "Order of the Alloy",
    "description": "Worshippers of all things made of Boromian Alloy. They really love treasure, and they will spend a long time searching for it.",
    "modifiers": {
      "event_money_mult": 2.0,
      "quest_money_mult": 1.5,
      "quest_time_multiplier": 2.0
    }
  }, {
    "id": 4,
    "name": "Arditi",
    "description": "Promises are sacred to the members of this cult. They will complete missions at any cost, even if it means losing possible treasure.",
    "modifiers": {
      "event_money_mult": 0.2,
      "quest_money_mult": 0.5,
      "roll_bonus": 5
    }
  }, {
    "id": 5,
    "name": "Fingers of Atlas",
    "description": "These cultists worship the free market, studying it obsessively. They always seem to manage to earn a bit more money than others by taking shortcuts & cost saving measures.",
    "modifiers": {
      "general_money_mult": 1.2,
      "general_xp_mult": 0.8
    }
  }, {
    "id": 6,
    "name": "Esoteric Order of the Serpent",
    "description": "Worshippers of the dead titan resting in Serpentbarrow. They perform daily animal sacrifices to commune with the Serpent, which grants them forbidden knowledge.",
    "modifiers": {
      "general_xp_mult": 1.2,
      "general_money_mult": 0.8,
      "quest_time_multiplier": 1.2
    }
  }, {
    "id": 7,
    "name": "Heresy remnants",
    "description": "Remnants of the old heretics that killed the God Empreror. They are trying to reclaim their power by restoring their lost artifacts that were lost during the final battle.",
    "modifiers": {
      "artifact_drop_bonus": 2,
      "upgrade_cost_multiplier": 2.0,
      "quest_time_multiplier": 1.2
    }
  }, {
    "id": 8,
    "name": "The Convergence",
    "description": "We are one. We are many.",
    "modifiers": {
      "xp_mult_per_player_in_cult": 1.01,
      "money_mult_per_player_in_cult": 0.95
    }
  }]
}