{
  "items": [{
    "description": "You find a locked chest.",
    "choices": [{
      "option": "Smash it open",
      "chance": 90,
      "success": "The chest lays at your feet, destroyed, some of its contents still intact.",
      "failure": "You completely destroyed the chest and its contents.",
      "rewards": "xp 20, mn 20",
      "maluses": "hp 2"
    }, {
      "option": "Lockpick it",
      "chance": 50,
      "success": "You manage to lockpick the chest, preserving its contents.",
      "failure": "You fail in your lock picking attempt. The chest remains closed.",
      "rewards": "xp 100, item (Odd)",
      "maluses": "mn 15"
    }, {
      "option": "Kick it open",
      "chance": 10,
      "success": "Miraculously the chest opens with a single kick. You feel very good about yourself.",
      "failure": "The kick does nothing. Your foot hurts.",
      "rewards": "xp 1000, item (Odd)",
      "maluses": "hp 50"
    }]
  }, {
    "description": "You hear faint crying coming from a room nearby.",
    "choices": [{
      "option": "Leave",
      "chance": 95,
      "success": "You leave, you don't want to get involved.",
      "failure": "As soon as you start to leave, the crying stops. You turn around and you see empty eye sockets stalking you. You run.",
      "rewards": "xp 10",
      "maluses": "hp 5, sa 10"
    }, {
      "option": "Investigate",
      "chance": 50,
      "success": "It turns out the crying was coming from a tied-up woman. You untie her and she rewards you with some Alloy.",
      "failure": "It turns out the crying was just an hallucination.",
      "rewards": "xp 100, mn 50",
      "maluses": "xp 200, sa 20"
    }]
  }, {
    "description": "You spot a piece of an artifact at the bottom of a well.",
    "choices": [{
      "option": "Throw a rock at it",
      "chance": 90,
      "success": "The rock hits the piece, shattering it in the process. You don't know why you did that but you are satisfied with your shot.",
      "failure": "You miss your shot. You leave, feeling defeated.",
      "rewards": "xp 20, sa 10",
      "maluses": "sa 5"
    }, {
      "option": "Descend with the help of a rope",
      "chance": 50,
      "success": "You manage to get to the bottom without falling.",
      "failure": "As soon as you pull on the rope to test it it snaps. You leave, exhaling a sigh of sadness.",
      "rewards": "xp 100, ap 1",
      "maluses": "xp 200"
    }]
  }, {
    "description": "You stumble upon a man wearing a yellow robe. He does not have facial features.",
    "choices": [{
      "option": "RUN",
      "chance": 50,
      "success": "You manage to slip away, undetected.",
      "failure": "You feel His presence growing in your mind. Madness overwhelms you.",
      "rewards": "xp 666",
      "maluses": "hp 100, sa 50"
    }, {
      "option": "RUN",
      "chance": 50,
      "success": "You manage to hide from him inside a nearby horse carcass.",
      "failure": "You feel His presence growing in your chest. The growing heat of Chaos overwhelms you.",
      "rewards": "xp 666",
      "maluses": "hp 100, sa 50"
    }, {
      "option": "RUN",
      "chance": 50,
      "success": "You start running, He ignores you.",
      "failure": "You feel his presence growing in your limbs. The pain overwhelms you.",
      "rewards": "xp 666",
      "maluses": "hp 100, sa 50"
    }, {
      "option": "KILL",
      "chance": 1,
      "success": "Against all your instincts you lunge at Him, landing a \"fatal\" blow. He vanishes, leaving behind some treasure.",
      "failure": "You are paralyzed by terror & consumed by madness.",
      "rewards": "xp 10000, item (Eldritch)",
      "maluses": "hp 666, mn 666, xp 666, sa 100"
    }]
  }, {
    "description": "You stumble upon a strange lady that offers you a potion, claiming it will make you stronger.",
    "choices": [{
      "option": "Refuse and leave",
      "chance": 90,
      "success": "You politely refuse & leave her be. You did not trust her.",
      "failure": "You rudely ignore her & it turns out she was a powerful Hag. You run.",
      "rewards": "xp 20",
      "maluses": "hp 5"
    }, {
      "option": "Accept and drink it",
      "chance": 50,
      "success": "The potion does actually make you feel stronger. You thank the lady and move on.",
      "failure": "The potion tastes horrible and apparently has mold in it. The lady laughs & disappears in a puff of smoke.",
      "rewards": "xp 420",
      "maluses": "hp 20, mn 200"
    }]
  }, {
    "description": "You encounter a living doll holding a squid. She insists in calling you \"Good Hunter\" and asks you to touch her.",
    "choices": [{
      "option": "Touch her",
      "chance": 90,
      "success": "You touch her & you suddenly feel stronger. She slowly fades away, as if she was a dream all along",
      "failure": "You try to touch her but it turns out she was an hallucination all along.",
      "rewards": "xp 100, sa 20",
      "maluses": "xp 100, sa 20"
    }, {
      "option": "Steal her squid.",
      "chance": 5,
      "success": "You manage to swipe her squid, which starts melting and turns into 3 artifact pieces that kind of look like umbilical cords.",
      "failure": "The moment you think of stealing her squid she disappears, as horrible visions of nightmarish monsters fill your mind.",
      "rewards": "xp 200, ap 3",
      "maluses": "hp 200, sa 50"
    }]
  }, {
    "description": "Suddenly, everything becomes silent. You are immersed in an endless sea of darkness & silence. A female voice speaks softly: \"I AM BOROM. I AM THE PLANET. I AM AFRAID\"",
    "choices": [{
      "option": "Run",
      "chance": 90,
      "success": "Whatever this thing is it's freaking you out, you try running but you can't move. You try waking up instead. It works.",
      "failure": "You can't run. You can't even move. The voice falls silent but the darkness remains. You wake some time later, covered in sweat.",
      "rewards": "xp 100",
      "maluses": "hp 20, sa 20"
    }, {
      "option": "Ask what she is afraid of",
      "chance": 38,
      "success": "\"DEATH. I NEED YOU TO PROTECT ME FROM DEATH. A PRESENCE INSIDE MY CORE KILLING ME. I NEED YOU. I LOVE YOU.\" You wake up a few moments later, light headed.",
      "failure": "You are terrified and cannot speak. You wake some time later, covered in sweat & bruises.",
      "rewards": "xp 3800",
      "maluses": "hp 50, xp 100, sa 25"
    }]
  }, {
    "description": "A talking crow lands on your shoulder and offers to tell you a secret for a piece of bread.",
    "choices": [{
      "option": "Give the crow bread",
      "chance": 90,
      "success": "The crow reveals a hidden path that leads to a some treasure.",
      "failure": "The crow eats the bread and flies away, leaving you with nothing.",
      "rewards": "xp 100",
      "maluses": "mn 10"
    }, {
      "option": "Shoo the crow away",
      "chance": 42,
      "success": "The crow flies off, and you find a shiny trinket where it was standing.",
      "failure": "The crow angrily caws and summons a flock to harass you.",
      "rewards": "xp 150, ap 1, sa 5",
      "maluses": "hp 50, mn 50"
    }]
}, {
    "description": "You encounter a ghost offering to show you a hidden treasure in exchange for your help in finding peace.",
    "choices": [{
      "option": "Help the ghost",
      "chance": 75,
      "success": "You help the ghost resolve its unfinished business and it leads you to a hidden room filled with treasure.",
      "failure": "Despite your efforts, the ghost remains restless and vanishes, leaving you with nothing but a chill.",
      "rewards": "xp 200, mn 200, sa 10",
      "maluses": "hp 5, xp 50, sa 5"
    }, {
      "option": "Ignore the ghost",
      "chance": 90,
      "success": "You ignore the ghost and continue your quest.",
      "failure": "The ghost becomes angry and lets out a blood curling scream.",
      "rewards": "xp 20, sa 5",
      "maluses": "hp 50, sa 10"
    }]
}, {
    "description": "You encounter a creepy vagabond who offers advice for a small fee of one of your toenails.",
    "choices": [{
      "option": "Rip off a toe nail",
      "chance": 50,
      "success": "You rip off one of your toe nails & the guy, looking hungrily at it, gives you valuable advice that helps you avoid a future danger.",
      "failure": "The guy is vague and unhelpful. You decide to cut his tongue.",
      "rewards": "xp 300",
      "maluses": "hp 50"
    }, {
      "option": "Refuse the offer",
      "chance": 90,
      "success": "You rightfully decide to ignore him.",
      "failure": "He lunges at you, scratching you. He runs off on all fours, never to be seen again.",
      "rewards": "xp 20, sa 5",
      "maluses": "hp 5"
    }]
}, {
    "description": "You find a wounded animal, struggling to move. It seems to be a rare creature around here.",
    "choices": [{
      "option": "Help the animal",
      "chance": 50,
      "success": "The creature recovers and grants you a magical boon as thanks for your kindness.",
      "failure": "Despite your efforts, the creature succumbs to its wounds, and you feel sorrowful as it fades away.",
      "rewards": "xp 250, mn 250",
      "maluses": "xp 100"
    }, {
      "option": "Leave it be",
      "chance": 80,
      "success": "You move on, not getting involved, and avoid any unnecessary danger.",
      "failure": "You later hear the creature’s mournful cry as a predator takes it. You regret your choice.",
      "rewards": "xp 50, sa 5",
      "maluses": "xp 20"
    }]
}, {
    "description": "You come across a strange well that supposedly grants wishes, but only at a cost.",
    "choices": [{
      "option": "Wish for Experience",
      "chance": 42,
      "success": "Your wish is granted, and you feel the hopes & dreams of lost adventurers fill you.",
      "failure": "The well demands a high price, draining your energy instead of granting the wish.",
      "rewards": "xp 1000",
      "maluses": "hp 80"
    }, {
      "option": "Wish for Wealth",
      "chance": 42,
      "success": "Your wish is granted, pouches full of Boromian Alloy materialize in front of you.",
      "failure": "The well demands a high price, draining your energy instead of granting the wish.",
      "rewards": "mn 1000",
      "maluses": "hp 80"
    }, {
      "option": "Wish for Fame",
      "chance": 42,
      "success": "Your wish is granted, people you meet down the road recognize and praise you.",
      "failure": "The well demands a high price, draining your energy instead of granting the wish.",
      "rewards": "rn 200",
      "maluses": "hp 80"
    }, {
      "option": "Wish for Power",
      "chance": 13,
      "success": "Your wish is granted, an artifact piece materializes in front of you.",
      "failure": "The well demands a high price, draining your energy instead of granting the wish.",
      "rewards": "ap 1",
      "maluses": "hp 200"
    }, {
      "option": "Leave it be",
      "chance": 90,
      "success": "You avoid the temptation and continue on your journey with no ill effects.",
      "failure": "You later regret not making a wish, as a challenge arises that you could have avoided.",
      "rewards": "xp 50, sa 5",
      "maluses": "xp 10"
    }]
}, {
    "description": "You see an item encased in strange glowing red stone.",
    "choices": [{
      "option": "Try to break the stone",
      "chance": 25,
      "success": "You manage to break the stone & you take the item with you.",
      "failure": "Despite your efforts, the stone won't break. Your hand hurts.",
      "rewards": "item (Eldritch)",
      "maluses": "hp 5"
    }, {
      "option": "Leave it be",
      "chance": 90,
      "success": "The rock looks unbreakable anyway, you leave.",
      "failure": "You later regret your choice as you learn that the item was infused with powerful boons.",
      "rewards": "xp 50, sa 5",
      "maluses": "xp 10, sa 5"
    }]
}, {
    "description": "A strange mist fills the path ahead, and a voice beckons you to enter, promising great rewards within.",
    "choices": [{
      "option": "Enter the mist",
      "chance": 60,
      "success": "Inside the mist, you find an enchanted grove, filled with rare plants and treasures.",
      "failure": "The mist disorients you, and you wander aimlessly for hours before finding your way out, exhausted.",
      "rewards": "xp 500, mn 500",
      "maluses": "hp 100, sa 5"
    }, {
      "option": "Avoid the mist",
      "chance": 90,
      "success": "You steer clear of the mysterious mist and continue on your journey safely.",
      "failure": "Later, you learn that those who braved the mist found valuable treasures.",
      "rewards": "xp 50, sa 5",
      "maluses": "xp 10"
    }]
  }, {
    "description": "A hooded figure offers you a mysterious glowing crystal, claiming it holds untold power.",
    "choices": [{
      "option": "Buy the crystal",
      "chance": 50,
      "success": "The crystal radiates with energy, enhancing your abilities as you feel a surge of power.",
      "failure": "The crystal crumbles to dust in your hands, leaving you with nothing but a sense of loss.",
      "rewards": "xp 500, sa 20",
      "maluses": "mn 500"
    }, {
      "option": "Decline the offer",
      "chance": 90,
      "success": "You refuse and avoid potential danger, saving your money for something more trustworthy.",
      "failure": "Later, you hear rumors that the crystal was real and the buyer became incredibly powerful.",
      "rewards": "xp 50, sa 5",
      "maluses": "xp 10, sa 5"
    }]
}, {
    "description": "A traveling bard offers to sing a song about your adventures, claiming it will spread your fame far and wide.",
    "choices": [{
      "option": "Let the bard sing",
      "chance": 70,
      "success": "The bard's song captivates the crowd, and soon you find yourself more well-known in the region.",
      "failure": "The bard’s song is terrible, and you become the laughing stock of the taverns.",
      "rewards": "rn 100, sa 50",
      "maluses": "rn 100"
    }, {
      "option": "Refuse the bard",
      "chance": 85,
      "success": "You avoid unwanted attention and continue on your journey in peace.",
      "failure": "Later, you hear another adventurer became famous thanks to the bard’s song.",
      "rewards": "xp 50, sa 5",
      "maluses": "xp 10, sa 5"
    }]
}, {
    "description": "You find an old, dusty book in an abandoned library, its pages filled with strange symbols and drawings.",
    "choices": [{
      "option": "Read the book",
      "chance": 50,
      "success": "The book reveals ancient knowledge, granting you new powers and insights into the arcane.",
      "failure": "The symbols confuse and overwhelm you, causing a painful headache before you throw the book aside.",
      "rewards": "xp 500",
      "maluses": "hp 100, sa 10"
    }, {
      "option": "Leave the book",
      "chance": 90,
      "success": "You decide to leave the mysterious tome untouched and exit the library unharmed.",
      "failure": "Later, you regret not learning what secrets the book could have revealed.",
      "rewards": "xp 50, sa 5",
      "maluses": "xp 10, sa 5"
    }]
}, {
    "description": "A mysterious blacksmith offers to forge you a weapon, but demands a payment in fragments of your soul in return.",
    "choices": [{
      "option": "Agree to the trade",
      "chance": 60,
      "success": "The blacksmith forges a powerful weapon that shimmers with enchantments, empowering you.",
      "failure": "The weapon is flawed, and you feel you’ve lost something precious for little gain.",
      "rewards": "item (Strange)",
      "maluses": "hp 100, sa 5"
    }, {
      "option": "Refuse the trade",
      "chance": 90,
      "success": "Whatever the blacksmith meant for 'something of personal value', you don't like it, so you leave.",
      "failure": "You wonder if the blacksmith's weapon could have given you the strength to overcome your next challenge.",
      "rewards": "xp 50, sa 5",
      "maluses": "xp 10, sa 5"
    }]
}, {
    "description": "At a crossroads, you meet an old hermit who claims he can see the future. He offers to tell you what lies ahead for a price.",
    "choices": [{
      "option": "Pay for the prophecy",
      "chance": 65,
      "success": "The hermit's prophecy proves accurate, helping you avoid a dangerous trap later on.",
      "failure": "The hermit mutters gibberish & vanishes, leaving you with more questions than answers.",
      "rewards": "xp 180",
      "maluses": "mn 50, sa 5"
    }, {
      "option": "Refuse the offer",
      "chance": 80,
      "success": "You save your Alloy and navigate your journey through your own instincts.",
      "failure": "You later fall into a trap that the hermit might have warned you about.",
      "rewards": "xp 70, sa 5",
      "maluses": "hp 10"
    }]
}, {
    "description": "At the edge of a mysterious lake, you see a shining weapon floating in the water. Legends say it belongs to a long-dead king.",
    "choices": [
      {
        "option": "Try to take the sword",
        "chance": 15,
        "success": "The weapon grants you immense power, recognizing you as its rightful wielder.",
        "failure": "As you reach for the sword, the lake pulls you under, leaving you gasping for air.",
        "rewards": "item (Eldritch)",
        "maluses": "hp 100"
      },
      {
        "option": "Leave the sword",
        "chance": 85,
        "success": "You leave the ancient relic undisturbed, avoiding whatever curse or challenge it may bring.",
        "failure": "Later, you hear of a hero who claimed the sword and became a legend.",
        "rewards": "xp 50, sa 5",
        "maluses": "xp 50, sa 5"
      }
    ]
    }, {
      "description": "A wounded animal limps into your campfire light, whimpering for help. It looks unusual, almost enchated.",
      "choices": [{
        "option": "Help the animal",
        "chance": 70,
        "success": "The animal transforms into a magical being who blesses you with power as thanks.",
        "failure": "The animal suddenly attacks, revealing itself to be a shapeshifter in disguise.",
        "rewards": "xp 1000",
        "maluses": "hp 100"
      }, {
        "option": "Drive the animal away",
        "chance": 90,
        "success": "You scare the creature off, ensuring your safety for the night.",
        "failure": "The animal suddenly attacks, revealing itself to be a shapeshifter in disguise.",
        "rewards": "xp 20",
        "maluses": "hp 100"
      }]
    }, {
      "description": "While traveling, you find an ornate necklace hanging from a tree branch. It hums with a strange energy.",
      "choices": [
        {
          "option": "Take the necklace",
          "chance": 55,
          "success": "The necklace enhances your abilities, resonating with your inner power.",
          "failure": "The necklace burns in your hands, and you feel cursed for taking it.",
          "rewards": "xp 1000",
          "maluses": "hp 100"
        },
        {
          "option": "Leave the necklace",
          "chance": 80,
          "success": "You avoid touching the strange object, ensuring your safety.",
          "failure": "Later, you meet someone who gained immense strength from wearing the necklace.",
          "rewards": "xp 20",
          "maluses": "rn 100"
        }
      ]
    }, {
      "description": "You find a strange, misshapen shrine. A jagged figure is barely visible through the grime.",
      "choices": [
        {
          "option": "Pray",
          "chance": 5,
          "success": "For a brief moment, you glimpse the Flaw of the World. Bliss. A tear runs down your cheek.",
          "failure": "For a brief moment, you glimpse the Flaw of the World. Dread. You try to claw your eyes out.",
          "rewards": "xp 314159",
          "maluses": "hp 314159"
        },
        {
          "option": "Ignore the shrine",
          "chance": 90,
          "success": "You avoid engaging with the shrine, you don't trust it, whatever it is.",
          "failure": "You feel a sharp pain in your head, then a bloody tear runs down your cheek.",
          "rewards": "xp 20",
          "maluses": "hp 50"
        }
      ]
    }, {
      "description": "You find a cool stick.",
      "choices": [
        {
          "option": "Pretend it's a sword and do some cool moves",
          "chance": 95,
          "success": "Cool swings dude.",
          "failure": "The stick breaks :(",
          "rewards": "xp 100, rn 100",
          "maluses": "rn 1"
        },
        {
          "option": "Pretend it's a spear and make it spin.",
          "chance": 95,
          "success": "Cool moves dude.",
          "failure": "The stick breaks :(",
          "rewards": "xp 100, rn 100",
          "maluses": "rn 1"
        },
        {
          "option": "Pretend it's a gun and do some cool tricks",
          "chance": 95,
          "success": "Nice aim dude.",
          "failure": "The stick breaks :(",
          "rewards": "xp 100, rn 100",
          "maluses": "rn 1"
        },
        {
          "option": "Leave it there",
          "chance": 20,
          "success": "You are lame.",
          "failure": "A pidgeon shits on you while you leave. You kinda deserve it.",
          "rewards": "xp 1",
          "maluses": "rn 100"
        }
      ]
    }, {
      "description": "You find a strange ethereal creature. It doesn't seem to acknowledge you.",
      "choices": [
        {
          "option": "Throw a rock at it",
          "chance": 5,
          "success": "You hit it and it disappears, leaving some strange dust behind.",
          "failure": "You miss it and it disappears, nothing really happens but it was kind of embarassing.",
          "rewards": "xp 600",
          "maluses": "rn 5"
        },
        {
          "option": "Ignore it",
          "chance": 90,
          "success": "You avoid engaging with the creature, you don't trust it, whatever it is.",
          "failure": "You try to leave but you are enthralled with the creature, you can't seem to turn away. You bump into a wall.",
          "rewards": "xp 20",
          "maluses": "hp 10"
        }
      ]
    }]
}